movie_store/app/controllers/blockbusters_controller.rb

    def index
        @blockbusters = Blockbuster.all
---
SELECT "blockbusters".* FROM "blockbusters"

    def show
        @blockbuster = Blockbuster.find(params[:id])
---
SELECT "blockbusters".* FROM "blockbusters" WHERE "blockbusters"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

    def create
        blockbuster = Blockbuster.create(name: params[:blockbuster][:name],
                                         genre: params[:blockbuster][:genre],
                                         year_released: params[:blockbuster][:year_released],
                                         award_nominee: params[:blockbuster][:award_nominee],
                                         quote: params[:blockbuster][:quote])
---
INSERT INTO "blockbusters" ("name", "genre", "year_released", "quote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Titantic"], ["genre", "aquatic"], ["year_released", 2018], ["quote", "wooo we are wet "], ["created_at", "2020-10-30 19:40:52.364831"], ["updated_at", "2020-10-30 19:40:52.364831"]]

    def edit
        @blockbuster = Blockbuster.find(params[:id])
---
SELECT "blockbusters".* FROM "blockbusters" WHERE "blockbusters"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

    def update
        @blockbuster = Blockbuster.find(params[:id])
        @blockbuster.update(name: params[:blockbuster][:name],
                            genre: params[:blockbuster][:genre],
                            year_released: params[:blockbuster][:year_released],
                            award_nominee: params[:blockbuster][:award_nominee],
                            quote: params[:blockbuster][:quote])
---
SELECT "blockbusters".* FROM "blockbusters" WHERE "blockbusters"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "blockbusters" SET "name" = ?, "year_released" = ?, "award_nominee" = ?, "quote" = ?, "updated_at" = ? WHERE "blockbusters"."id" = ?  [["name", "2001: A Scooby Odyssey"], ["year_released", 1984], ["award_nominee", nil], ["quote", "Scooby dooby doo"], ["updated_at", "2020-10-30 20:04:40.960214"], ["id", 20]]

    def destroy
        @blockbuster = Blockbuster.find(params[:id])
        @blockbuster.delete
---
SELECT "blockbusters".* FROM "blockbusters" WHERE "blockbusters"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "blockbusters" WHERE "blockbusters"."id" = ?  [["id", 22]]